In [27]:
import pandas as pd
import numpy as  np

In [28]:
pd.Series?

In [29]:
pd.Series(['one','two','three'])

0      one
1      two
2    three
dtype: object

In [30]:
x = pd.Series([1,2,3,4])
x

0    1
1    2
2    3
3    4
dtype: int64

In [31]:
s = {'Cricket':'India','Soccer':'Germany','Golf':'Usa'}
ser = pd.Series(s)  # Keys of the dict have become new indices!!
ser

Cricket      India
Golf           Usa
Soccer     Germany
dtype: object

In [32]:
ser.iloc[2] # value corresponding to the index is displayed

'Germany'

In [33]:
ser.loc['Cricket'] # .loc[index] gives the same thing as above

'India'

In [34]:
#ser.loc['India'] this wont work

In [35]:
%%timeit -n 10 # magic function for measuring execution time
p = pd.Series(np.random.randint(0,100,1000))
p +=2

360 µs ± 137 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [36]:
crckt_countries = pd.Series(['Australia','Pakistan'], index =['Cricket','Cricket'])
crckt_countries

Cricket    Australia
Cricket     Pakistan
dtype: object

In [37]:
ser.append(crckt_countries) # appendinhg lists

Cricket        India
Golf             Usa
Soccer       Germany
Cricket    Australia
Cricket     Pakistan
dtype: object

In [38]:
ser.loc['Cricket']

'India'

In [39]:
ser  # ser dosent change after appending

Cricket      India
Golf           Usa
Soccer     Germany
dtype: object

In [40]:
d1 = {'Name':'Devendra','Post':'AD','Age':32,'Place':'ASR'}
d2= {'Name':'Nidhi','Post':'AM','Age':'29','Place':'ASR'}
d3= {'Name':'Bindu','Post':'SAPC','Age':'29','Place':'Bpl'}

In [41]:
df1 = pd.DataFrame([d1,d2,d3], index=['One','Two','Three'])
df1

      Age      Name Place  Post
One    32  Devendra   ASR    AD
Two    29     Nidhi   ASR    AM
Three  29     Bindu   Bpl  SAPC

In [42]:
df1[df1['Place'] !='ASR']

      Age   Name Place  Post
Three  29  Bindu   Bpl  SAPC

In [43]:
df1.T

            One    Two  Three
Age          32     29     29
Name   Devendra  Nidhi  Bindu
Place       ASR    ASR    Bpl
Post         AD     AM   SAPC

In [44]:
df1

      Age      Name Place  Post
One    32  Devendra   ASR    AD
Two    29     Nidhi   ASR    AM
Three  29     Bindu   Bpl  SAPC

In [45]:
df1.loc['One']['Name'] # chaining with index

'Devendra'

In [46]:
df2 = pd.read_csv('olympics.csv')
df2.index

RangeIndex(start=0, stop=148, step=1)

In [47]:
df2 = pd.read_csv('olympics.csv',index_col=0,skiprows=1)
df2.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [48]:
df2.columns

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [49]:
for column in df2.columns:
    if  column[:2] =='01':
        df2.rename(columns ={ column : 'Gold'+column[4:]}, inplace=True)
    if column[:2] == '02':
        df2.rename(columns ={column : 'Silver'+column[4:]},inplace=True)
    if  column[:2] == '03':
        df2.rename(columns ={column : 'Bronze'+column[4:]},inplace=True)   
df2.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [50]:
df3 = df2[df2['Gold'] > 2]
df3.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
Austria (AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304

In [51]:
df4.count()

NameError: name 'df4' is not defined

In [ ]:
df2.count()

In [ ]:
len(df2[(df2['Gold'] > 0 )| df2['Gold.1'] > 0 ])

In [ ]:
df2.index

In [ ]:
df2['Countries'] = df2.index
df2.head()

In [ ]:
df2 = df2.set_index('Gold')
df2.head()

In [ ]:
df2.reset_index()
df2.head()

In [ ]:
df3 = pd.read_csv('census.csv')
df3.head()

In [ ]:
x = df3.columns
x

In [ ]:
len(x)

In [ ]:
df3 = df3.set_index(['STNAME','CTYNAME'])
df3.head()

In [ ]:
df3.loc['Alabama']

In [ ]:
df3.loc['Alabama','Autauga County']

In [ ]:
df3.loc[[('Alabama','Autauga County'),('Alabama','Barbour County')]]

In [ ]:
df3.index
df3['a'] = df3.index
df3.head()

In [ ]:
df3['a']

In [ ]:
df2.head()

In [ ]:
df10 = df2.sort_values('Gold',ascending=[0])
df10

In [52]:
census_df = pd.read_csv('census.csv')
df5 = census_df.copy()
df5 = df5[df5['SUMLEV'] > 40]
cols_to_keep = ['STNAME','CTYNAME','BIRTHS2010','BIRTHS2011','BIRTHS2012','BIRTHS2013','BIRTHS2014','BIRTHS2015','POPESTIMATE2010',
                   'POPESTIMATE2011','POPESTIMATE2012','POPESTIMATE2013','POPESTIMATE2014','POPESTIMATE2015','CENSUS2010POP']
df5 = df5[cols_to_keep]
st_list= set((df5['STNAME']))
df5 = df5.set_index(['STNAME','CTYNAME'])
df5.head()

                        BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME  CTYNAME
Alabama Autauga County         151         636         615         574
        Baldwin County         517        2187        2092        2160
        Barbour County          70         335         300         283
        Bibb County             44         266         245         259
        Blount County          183         744         710         646

                        BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Autauga County         623         600            54660
        Baldwin County        2186        2240           183193
        Barbour County         260         269            27341
        Bibb County            247         253            22861
        Blount County          618         603            57373

                        POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME  CTYNAME
Alabama Autauga County            55253            55175            55038
        Baldwin County           186659           190396           195126
        Barbour County            27226            27159            26973
        Bibb County               22733            22642            22512
        Blount County             57711            57776            57734

                        POPESTIMATE2014  POPESTIMATE2015  CENSUS2010POP
STNAME  CTYNAME
Alabama Autauga County            55290            55347          54571
        Baldwin County           199713           203709         182265
        Barbour County            26815            26489          27457
        Bibb County               22549            22583          22915
        Blount County             57658            57673          57322

In [ ]:
len(df5.loc['Alabama'])

In [ ]:
dict1 = {}
for x in st_list:
    #print(len(df5.loc[x]))
    dict1[x] = len(df5.loc[x])
dict1

In [ ]:
import operator
dict2 = sorted(dict1.items(), key=operator.itemgetter(1))
dict2

In [ ]:
dict2[len(dict2)-1][0]

In [ ]:
df5.head()

In [ ]:
df5.loc['Alabama','Bibb County']

In [ ]:
l1={}
l2={}
for x in st_list:
    l1[x] = df5.loc[x].index
        #print(df5.loc[x,cty]['CENSUS2010POP'])
    l2[x] =[cty for cty in l1[x]]   
l2

In [ ]:
l3 = l2.keys()
l4 = l2.values()
l2["Alabama"]

In [ ]:
import operator
l1 =[]
l10={}
for x in st_list:
    l1=[]
    dict1={}
    for y in l2[x]:
        #print(df5.loc[x,y]['CENSUS2010POP'])
        dict1[y] = (df5.loc[x,y]['CENSUS2010POP'])
        #print(dict1)
    sorted_dict1 = sorted(dict1.items(), key=operator.itemgetter(1),reverse=True)
   #print(x,dict1)
    l1.append(sorted_dict1)
    #print(len((l1)))
    #print(sorted_dict1)
    l10[x]=l1[0][0:3]
l10

In [53]:
census_df = pd.read_csv('census.csv')
df5 = census_df.copy()
df5 = df5[df5['SUMLEV'] > 40]
cols_to_keep = ['STNAME','CTYNAME','BIRTHS2010','BIRTHS2011','BIRTHS2012','BIRTHS2013','BIRTHS2014','BIRTHS2015','POPESTIMATE2010',
                   'POPESTIMATE2011','POPESTIMATE2012','POPESTIMATE2013','POPESTIMATE2014','POPESTIMATE2015','CENSUS2010POP']
df5 = df5[cols_to_keep]
st_list= set((df5['STNAME']))
df5 = df5.set_index(['STNAME','CTYNAME'])
grouped = df5.groupby(['STNAME']).sum()
#grouped
grouped.sort_values(['CENSUS2010POP'], axis=0, ascending=False, inplace=False, kind='quicksort').head(3).index

Index(['California', 'Texas', 'New York'], dtype='object', name='STNAME')

In [ ]:
df5

In [ ]:
pd.__version__

In [ ]:
grouped.head()

In [ ]:
df5

In [54]:
grouped = df5.groupby(df5.index.get_level_values(0)).sum()
#grouped
top3 = grouped.sort_values(['CENSUS2010POP'], axis=0, ascending=False, inplace=False, kind='quicksort').head(3).index
top3

Index(['California', 'Texas', 'New York'], dtype='object', name='STNAME')